{
    "notes": [
        "In general, queries will only return 'active' resources. If a resource has been marked as inactive for any reason - eg entered in error or no longer considered current then they will only be returned when the query specifies them (and the syntax will vary for each resource type. See examples below."
    ],
    "queries": [
        {
            "type": "Patient",
            "examples": [
                {
                    "qry": "/$summary?identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345",
                    "validation": "This query is expected to fail test validation as is not implemented on the test server",
                    "doc": "Retrieve a health summary using the patient NHI"
                },
                {
                    "qry": "?identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345",
                    "doc": "Retrieve the demographics (Patient resource) using the patient NHI. The result will be a bundle with (hopefully) a single resource in it."
                }
            ]
        },
        {
            "type": "Condition",
            "examples": [
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345",
                    "doc": "Retrieve all the conditions for a patient with the NHI number ABC2345"
                },
                {
                    "qry": "?patient._id=XXX",
                    "doc": "Retrieve all the conditions for a patient with the id of XXX. This is not the same as the patient NHI which is an identifier."
                },
                {
                    "qry": "/XXX",
                    "doc": "Retrieve a single condition with a known id (XXX). ",
                    "validation": "This query is expected to fail test validation as the resource does not exist on the test server"
                },
                {
                    "qry": "?_id=YYY",
                    "doc": "Retrieve a single condition with a known id of YYY. This differs from the previous example as it is a search, and so the resource is returned within a bundle "
                },
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&long-term-condition=true",
                    "doc": "Return conditions marked as 'long term' within medTech",
                    "validation": "This query is expected to fail test validation as the search parameter does not exist on the test server"
                },
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&clinical-status=inactive",
                    "doc": "Returns conditions that are marked as inactive. Generally, inactive conditions are not returned in a query"
                },
                {
                    "qry": "?patient.identifier=ABC2356&_security=http://terminology.hl7.org/CodeSystem/v3-Confidentiality|R",
                    "doc": "Returns conditions that are marked as confidential within medTech. Generally, confidential conditions are not returned. Note that there are other security requirements for returning confidential information"
                },
                {
                    "qry": "",
                    "doc": " "
                }
            ]
        },
        {
            "type": "MedicationRequest",
            "examples": [
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345",
                    "doc": "Retrieve all the prescriptions for a patient with the NHI number ABC2345"
                },
                {
                    "qry": "?patient._id=XXX",
                    "doc": "Retrieve all the prescriptions for a patient with the id of XXX. This is not the same as the patient NHI which is an identifier."
                },
                {
                    "qry": "/XXX",
                    "doc": "Retrieve a single prescription with a known id (XXX). ",
                    "validation": "This query is expected to fail test validation as the resource does not exist on the test server"
                },
                {
                    "qry": "?_id=YYY",
                    "doc": "Retrieve a single prescription with a known id of YYY. This differs from the previous example as it is a search, and so the resource is returned within a bundle "
                },
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&long-term-medication=true",
                    "doc": "Return prescriptions marked as 'long term' within medTech",
                    "validation": "This query is expected to fail test validation as the search parameter does not exist on the test server"
                },
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&status:not=active",
                    "doc": "Returns prescriptions that are marked as inactive. Generally, inactive conditions are not returned in a query"
                },
                {
                    "qry": "?patient.identifier=ABC2356&_security=http://terminology.hl7.org/CodeSystem/v3-Confidentiality|R",
                    "doc": "Returns prescriptions that are marked as confidential within medTech. Generally, confidential conditions are not returned. Note that there are other security requirements for returning confidential information"
                },
                {
                    "qry": "",
                    "doc": " "
                }
            ]
        },
        {
            "type": "Observation",
            "title": "Screening Observations",
            "notes": "These queries are descigned to return 'screening' information such as blood pressure. They explicitly exclude laboratory results.",
            "examples": [
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&category:not=laboratory",
                    "doc": "Retrieve all the Observations that are not laboratory observations for a patient with the NHI number ABC2345"
                },
                {
                    "qry": "?patient._id=XXX&category:not=laboratory",
                    "doc": "Retrieve all the observations that are not laboratory observations for a patient with the id of XXX. This is not the same as the patient NHI which is an identifier."
                },
                {
                    "qry": "/YYY",
                    "doc": "Retrieve a single observation with a known id (YYY). ",
                    "validation": "This query is expected to fail test validation as the resource does not exist on the test server"
                },
                {
                    "qry": "?_id=YYY",
                    "doc": "Retrieve a single observation with a known id of YYY. This differs from the previous example as it is a search, and so the resource is returned within a bundle "
                },
                {
                    "qry": "?patient.identifier=ABC2356&category:not=laboratory=&_security=http://terminology.hl7.org/CodeSystem/v3-Confidentiality|R",
                    "doc": "Returns observations that are marked as confindential within medTech. Generally, confidential resources are not returned. Note that there are other security requirements for returning confidential information"
                },
                {
                    "qry": "",
                    "doc": " "
                }
            ]
        },
        {
            "type": "DocumentReference",
            "notes": "DocumentReference resources are used for clinical notes (eg consultations) and external documents such as discharge summaries.",
            "examples": [
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345",
                    "doc": "Retrieve all the DocumentReference resources for a patient with the NHI number ABC2345"
                },
                {
                    "qry": "?patient._id=XXX",
                    "doc": "Retrieve all the DocumentReference resources for a patient with the id of XXX. This is not the same as the patient NHI which is an identifier."
                },
                {
                    "qry": "/YYY",
                    "doc": "Retrieve a single DocumentReference resource with a known id (YYY). Returns a single resource",
                    "validation": "This query is expected to fail test validation as the resource does not exist on the test server"
                },
                {
                    "qry": "?_id=YYY",
                    "doc": "Retrieve a single DocumentReference resource with a known id of YYY. This differs from the previous example as it is a search, and so the resource is returned within a bundle "
                },
                {
                    "qry": "?patient.identifier=ABC2356&_security=http://terminology.hl7.org/CodeSystem/v3-Confidentiality|R",
                    "doc": "Returns DocumentReference resources that are marked as confidential within medTech. Generally, confidential resources are not returned. Note that there are other security requirements for returning confidential information"
                },
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&type=http://loinc.org|11488-4",
                    "doc": "Return all DocumentReference resources for the patient based on NHI that are consultation notes (as opposed to external documents such as Discharge Summaries)"
                },
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&type=http://loinc.org|11488-4&_security= https://terminology.hl7.org/CodeSystem/v3-Confidentiality|R",
                    "doc": "Return all DocumentReference resources for the patient based on NHI that are consultation notes (as opposed to external documents such as Discharge Summaries) which have been marked as confidential. Note that there are other security constraints that need to be satisfied."
                }
            ]
        },
        {
            "type": "DocumentReference",
            "title": "RSD Documents",
            "notes": "DocumentReference resources are used for clinical notes (eg consultations) and external documents such as discharge summaries. These examples are for RSD (Referral/Status/Discharge documents only",
            "examples": [
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id&ABC2356&_security=http://terminology.hl7.org/CodeSystem/v3-Confidentiality|R&type=http://loinc.org|34109-9",
                    "doc": "Returns DocumentReference resources that are marked as confidential within medTech. Generally, confidential resources are not returned. Note that there are other security requirements for returning confidential information"
                },
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&type=http://loinc.org|34109-9",
                    "doc": "Return all DocumentReference resources for the patient based on NHI that are consultation notes (as opposed to external documents such as Discharge Summaries)"
                }
            ]
        },
        {
            "type": "Immunization",
            "examples": [
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345",
                    "doc": "Retrieve all the Immunization resources resources for a patient with the NHI number ABC2345"
                },
                {
                    "qry": "?patient._id=XXX",
                    "doc": "Retrieve all the Immunization resources for a patient with the id of XXX. This is not the same as the patient NHI which is an identifier."
                },
                {
                    "qry": "/XXX",
                    "doc": "Retrieve a single Immunization resource with a known id (XXX). Returns a single resource",
                    "validation": "This query is expected to fail test validation as the resource does not exist on the test server"
                },
                {
                    "qry": "?_id=xxx",
                    "doc": "Retrieve a single Immunization resource with a known id (xxx). Returns a bundle containing a single resource"
                }
            ]
        },
        {
            "type": "DiagnosticReport",
            "title": "Lab reports",
            "notes": "The actual result (like a Haemoglobin) is recorded as an observation - the DiagnosticReport has information about the lab that perfromed the test. The _include modifier is used to include the individual values in the same query",
            "examples": [
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&_include=DiagnosticReport.result",
                    "doc": "Retrieve all the Lab results (DiagnosticReport and references Observations) for a patient with the NHI number ABC2345"
                },
                {
                    "qry": "?patient._id=XXX",
                    "doc": "Retrieve all the Lab results for a patient with the id of XXX. This is not the same as the patient NHI which is an identifier."
                },
                {
                    "qry": "/YYY",
                    "doc": "Retrieve a single Lab report with a known lab id (YYY). Returns a single DiagnosticReport resource but not the referenced Observations. These will need to be retrieved separately with queries against Observation - eg GET [host]/Observation/{obs id}",
                    "validation": "This query is expected to fail test validation as the resource does not exist on the test server"
                },
                {
                    "qry": "?_id=xxx&_include=DiagnosticReport.result",
                    "doc": "Retrieve a single Immunization resource with a known lab id (xxx). Returns a bundle containing a single DiagnosticReport resource and the references Observations"
                }
            ]
        },
        {
            "type": "AllergyIntolerance",
            "examples": [
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345",
                    "doc": "Retrieve all the allergies for a patient with the NHI number ABC2345. This includes inactive as well as active."
                },
                {
                    "qry": "?patient._id=XXX",
                    "doc": "Retrieve all the allergies for a patient with the id of XXX. This is not the same as the patient NHI which is an identifier."
                },
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&clinical-status=active",
                    "doc": "Retrieve the active allergies for a patient with the NHI number ABC2345. Inactive are not included."
                },
                {
                    "qry": "?patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&clinical-status=active&date=ge2020",
                    "doc": "Retrieve the active allergies for a patient with the NHI number ABC2345 where the recorded date was 2020 or later"
                }
            ]
        },
        {
            "type": "Slot",
            "title": "Appointments",
            "examples": [
                {
                    "qry": "?schedule.actor.identifier=https://standards.digital.health.nz/ns/hpi-person-id|HPICPNXXXX&start=ge2020-01-21T11:00:00Z",
                    "doc": "Retrieve all the appointment slots for the provider with the HPI number HPICPNXXXX starting from 11am 21st Januarty 2020. By default one weeks worth will be returned."
                },
                {
                    "qry": "?schedule.actor.identifier=https://standards.digital.health.nz/ns/hpi-person-id|HPICPNXXXX&start=ge2020-01-21T11:00:00Z&start=le2020-01-21T18:00:00Z",
                    "doc": "Same as the previous query, but the end date is specified"
                },
                {
                    "qry": "?schedule.actor.identifier=https://standards.digital.health.nz/ns/hpi-person-id|HPICPNXXXX&start=ge2020-01-21T11:00:00Z&status=free",
                    "doc": "Return the free appointment slots for one week (default period) from 11am 21st Januarty 2020."
                }
            ]
        }
    ]
}